20MB/test5-Split.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   275.031 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810539970
HTML transferred:       2850 bytes
Requests per second:    0.11 [#/sec] (mean)
Time per request:       9167.685 [ms] (mean)
Time per request:       9167.685 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        2878.02 kb/s sent
                        2878.04 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:  5995 9167 3808.8   8364   22863
Waiting:     4626 7598 3692.1   6572   20930
Total:       5995 9168 3808.8   8364   22863

Percentage of the requests served within a certain time (ms)
  50%   8364
  66%   8986
  75%   9681
  80%  10308
  90%  16560
  95%  17825
  98%  22863
  99%  22863
 100%  22863 (longest request)