20MB/test5-Split.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   244.490 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810539970
HTML transferred:       2850 bytes
Requests per second:    0.12 [#/sec] (mean)
Time per request:       8149.672 [ms] (mean)
Time per request:       8149.672 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        3237.52 kb/s sent
                        3237.55 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:  6192 8149 1414.2   7731   11515
Waiting:     4819 6643 1390.2   6342    9999
Total:       6192 8150 1414.2   7731   11515

Percentage of the requests served within a certain time (ms)
  50%   7731
  66%   8350
  75%   8809
  80%   9557
  90%  10447
  95%  11326
  98%  11515
  99%  11515
 100%  11515 (longest request)