20MB/test6-Origin.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload2
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   256.419 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810540000
HTML transferred:       2850 bytes
Requests per second:    0.12 [#/sec] (mean)
Time per request:       8547.290 [ms] (mean)
Time per request:       8547.290 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        3086.92 kb/s sent
                        3086.94 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:  6059 8547 2934.7   8041   20138
Waiting:     4565 7019 2788.4   6551   17893
Total:       6059 8547 2934.7   8041   20139

Percentage of the requests served within a certain time (ms)
  50%   8041
  66%   8882
  75%   8937
  80%   9121
  90%  10473
  95%  16469
  98%  20139
  99%  20139
 100%  20139 (longest request)