20MB/test6-Split.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   234.105 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810539970
HTML transferred:       2850 bytes
Requests per second:    0.13 [#/sec] (mean)
Time per request:       7803.492 [ms] (mean)
Time per request:       7803.492 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        3381.15 kb/s sent
                        3381.18 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:  6144 7803 1070.8   7610   11137
Waiting:     4681 6358 1075.9   6169    9706
Total:       6145 7803 1070.8   7611   11138

Percentage of the requests served within a certain time (ms)
  50%   7611
  66%   7923
  75%   8097
  80%   8399
  90%   9718
  95%  10104
  98%  11138
  99%  11138
 100%  11138 (longest request)