20MB/test7-Origin.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload2
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   248.361 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810540000
HTML transferred:       2850 bytes
Requests per second:    0.12 [#/sec] (mean)
Time per request:       8278.708 [ms] (mean)
Time per request:       8278.708 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        3187.06 kb/s sent
                        3187.09 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:  6139 8278 1543.3   8071   12148
Waiting:     4782 6774 1494.1   6599   10675
Total:       6140 8279 1543.3   8072   12149

Percentage of the requests served within a certain time (ms)
  50%   8072
  66%   8595
  75%   9172
  80%   9348
  90%  11481
  95%  11511
  98%  12149
  99%  12149
 100%  12149 (longest request)