20MB/test7-Origin.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload2
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   244.427 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810540000
HTML transferred:       2850 bytes
Requests per second:    0.12 [#/sec] (mean)
Time per request:       8147.562 [ms] (mean)
Time per request:       8147.562 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        3238.36 kb/s sent
                        3238.39 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:  6133 8147 1451.8   7736   11458
Waiting:     4783 6610 1481.6   6262   10192
Total:       6134 8148 1451.8   7736   11458

Percentage of the requests served within a certain time (ms)
  50%   7736
  66%   8358
  75%   8680
  80%   9913
  90%  10677
  95%  10920
  98%  11458
  99%  11458
 100%  11458 (longest request)