20MB/test7-Split.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   237.062 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810539970
HTML transferred:       2850 bytes
Requests per second:    0.13 [#/sec] (mean)
Time per request:       7902.080 [ms] (mean)
Time per request:       7902.080 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        3338.96 kb/s sent
                        3338.99 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       2
Processing:  6125 7902 1707.9   7632   14355
Waiting:     4771 6434 1522.0   6190   11436
Total:       6125 7902 1707.8   7632   14355

Percentage of the requests served within a certain time (ms)
  50%   7632
  66%   7911
  75%   8245
  80%   8616
  90%  10549
  95%  11108
  98%  14355
  99%  14355
 100%  14355 (longest request)