20MB/test7-Split.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   222.926 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810539970
HTML transferred:       2850 bytes
Requests per second:    0.13 [#/sec] (mean)
Time per request:       7430.879 [ms] (mean)
Time per request:       7430.879 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        3550.69 kb/s sent
                        3550.72 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:  5784 7431 866.1   7442    9080
Waiting:     4492 6006 848.7   6006    7708
Total:       5785 7431 866.1   7442    9080

Percentage of the requests served within a certain time (ms)
  50%   7442
  66%   7652
  75%   7829
  80%   8415
  90%   8873
  95%   9046
  98%   9080
  99%   9080
 100%   9080 (longest request)