20MB/test8-Origin.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload2
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   243.096 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810540000
HTML transferred:       2850 bytes
Requests per second:    0.12 [#/sec] (mean)
Time per request:       8103.193 [ms] (mean)
Time per request:       8103.193 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        3256.09 kb/s sent
                        3256.12 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:  6487 8103 982.5   7978   10165
Waiting:     5059 6621 923.0   6582    8688
Total:       6487 8103 982.5   7978   10165

Percentage of the requests served within a certain time (ms)
  50%   7978
  66%   8317
  75%   8849
  80%   8970
  90%   9708
  95%  10156
  98%  10165
  99%  10165
 100%  10165 (longest request)